<?php

/**
 * Один из способов определения победителя в футболе это пенальти. Процесс 
 * идет так: В каждой попытке бьет игрок каждой из команд и определяется 
 * команда победитель этой попытки. Процесс продолжается до 5 попыток, 
 * хотя победитель может быть выявлен и раньше. Если после пяти попыток 
 * победитель не выявлен, то процесс продолжается до первой выигранной попытки.
 * 
 * Реализуйте функцию bestAttempt которая принимает на вход 
 * результаты попыток и возвращает массив со списком имен футбольных 
 * клубов, которые победили в каждой из попыток. Если результатом попытки 
 * была ничья, то в результирующем массиве она не фигурирует (потому что 
 * никто не победил).
 */

function bestAttempt($first, $second)
{
    $resultmap = array_map(function ($a, $b) {
        if ($a['scored'] > $b['scored']) {
            return $a['name'];
        } elseif ($a['scored'] < $b['scored']) {
            return $b['name'];
        } elseif ($a['scored'] == $b['scored']) {
            return null;
        }
    }, $first, $second);
    $result = array_filter($resultmap, function ($item) {
        return !is_null($item);
    });
    return array_values($result);
}